artillery/start_0.yml
config:
  target: "http://172.19.0.2:8080"
  phases:
    - duration: 5
      arrivalCount: 1
scenarios:    
  - name: Create Account
    flow:
      - post:
          url: "/create_account"
      - post:
          url: "/create_account"
      - post:
          url: "/create_account"
      - post:
          url: "/mine"
      - post:
          url: "/mine"