artillery/workload_3.yml
config:
  target: "http://172.19.0.5:8080"
  phases:
    - duration: 20
      arrivalRate: 5
  payload:
    path: "./valores_1.csv"
    fields:
      - "transaction"
scenarios:
  - name: Send Transaction
    weight: 3/4
    flow:
      - post:
          url: "/transaction"
          json: "{{transaction}}"
  - name: Get Ledger
    weight: 1/4
    flow:
      - post:
          url: "/ledger"